In [1]:
%load_ext sql
%config SqlMagic.autocommit=False # for engines that do not support autommit

In [2]:
%env DATABASE_URL=postgresql://postgres:admin@localhost:5432/postgres
%sql SELECT 1 as "Test"

env: DATABASE_URL=postgresql://postgres:admin@localhost:5432/postgres
1 rows affected.

[(1,)]

In [3]:
%%sql

select * from orders limit 10;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

In [4]:
%%sql

TRUNCATE TABLE orders;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [5]:
import pandas as pd
import json

In [6]:
#This Function will helps to get columns name of respecetd dataset
def get_column_names(schemas, ds_name, sorting_key='column_position'):
    column_details = schemas[ds_name]
    columns = sorted(column_details, key= lambda col: col[sorting_key])
    return [col['column_name'] for col in columns]

In [7]:
schema = json.load(open('data/retail_db/schemas.json'))

In [8]:
columns = get_column_names(schema, 'orders')
columns

['order_id', 'order_date', 'order_customer_id', 'order_status']

In [9]:
df = pd.read_csv('data/retail_db/orders/part-00000',
                 names=columns
                 )
df

       order_id             order_date  order_customer_id     order_status
0             1  2013-07-25 00:00:00.0              11599           CLOSED
1             2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2             3  2013-07-25 00:00:00.0              12111         COMPLETE
3             4  2013-07-25 00:00:00.0               8827           CLOSED
4             5  2013-07-25 00:00:00.0              11318         COMPLETE
...         ...                    ...                ...              ...
68878     68879  2014-07-09 00:00:00.0                778         COMPLETE
68879     68880  2014-07-13 00:00:00.0               1117         COMPLETE
68880     68881  2014-07-19 00:00:00.0               2518  PENDING_PAYMENT
68881     68882  2014-07-22 00:00:00.0              10000          ON_HOLD
68882     68883  2014-07-23 00:00:00.0               5533         COMPLETE

[68883 rows x 4 columns]

In [10]:
conn_url = 'postgresql://postgres:admin@localhost:5432/postgres'

In [11]:
df.to_sql('orders',
          con=conn_url,
          if_exists='replace',
          index= False
          )

In [ ]:
pd.read_sql('orders',conn_url)